"""
작성일: 2020-00-00
==============================================================================
문제 위치: 교재 363p
==============================================================================
소요 시간: 24분
"""

import sys

input = sys.stdin.readline

n = int(input().strip())
card_list = [0]
for _ in range(n):
    card = int(input().strip())
    card_list.append(card)
card_list.sort()

d = [0] * (n + 1)

d[1] = card_list[1]
d[2] = card_list[1] + card_list[2]
for i in range(3, n + 1):
    d[i] = (2 * d[i - 1]) + card_list[i]

print(d[n])

"""
f(1) = 1
f(2) = 1 + 2
f(3) = (1 + 2) + (1 + 2) + 3
f(4) = ((1 + 2) + (1 + 2) + 3) + ((1 + 2) + (1 + 2) + 3) + 4
f(k) = 2f(k-1) + k
==============================================================================
개선점: 개선할 수 있는 부분
"""