"""
작성일: 2020-08-30
==============================================================================
문제 위치: 교재 226p
==============================================================================
소요 시간: 14분
"""

n, m = map(int, input().split())
array = []
for i in range(n):
    array.append(int(input()))

d = [100_000] * (m + 1)

for money in array:
    for i in range(2, m + 1):
        if i > money:
            d[i] = d[i - money] + 1
        if i % money == 0:
            d[i] = min(d[i], i // money)

if d[m] > 10000:
    print(-1)
else:
    print(d[m])


"""
접근법: 내가 왜 이런 방식으로 문제를 해결했는지 작성
==============================================================================
개선점: 개선할 수 있는 부분
"""