"""
작성일: 2020-08-22
==============================================================================
문제 위치: 교재 113p (예제문제)
==============================================================================
소요 시간: 11분
"""

n = int(input(""))

count = 0

for hour in range(n + 1):
    for minute in range(60):
        for second in range(60):
            hour = str(hour)
            minute = str(minute)
            second = str(second)
            if (hour.find(str(n)) < 0) and (minute.find(str(n)) < 0) and (second.find(str(n)) < 0):
                continue
            count += 1

print(count)

"""
접근법: 단순하게 완전탐색 알고리즘을 사용해서 시간 문자열에 3이 있는지를 비교하고 count를 올린다.
==============================================================================
개선점: 
==============================================================================
코멘트: 스터디 조원들의 코멘트
"""